ch8/ch8-4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-17 Thu 10:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 8.4</title>
<meta name="author" content="pedh" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Chapter 8.4</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd57a39b">ch8.4</a>
<ul>
<li><a href="#org261799a">8.4-1</a></li>
<li><a href="#org19a1fb8">8.4-2</a></li>
<li><a href="#org342c1ad">8.4-3</a></li>
<li><a href="#org65378e4">8.4-4</a></li>
<li><a href="#org89b5411">8.4-5</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd57a39b" class="outline-2">
<h2 id="orgd57a39b">ch8.4</h2>
<div class="outline-text-2" id="text-orgd57a39b">
</div>
<div id="outline-container-org261799a" class="outline-3">
<h3 id="org261799a">8.4-1</h3>
<div class="outline-text-3" id="text-org261799a">
<pre class="example">
|    |   A |   |   | B         |
|----+-----+---+---+-----------|
|  1 | .79 |   | 0 |           |
|  2 | .13 |   | 1 | (.13 .16) |
|  3 | .16 |   | 2 | (.20)     |
|  4 | .64 |   | 3 | (.39)     |
|  5 | .39 |   | 4 | (.4)      |
|  6 | .20 |   | 5 | (.53)     |
|  7 | .89 |   | 6 | (.64)     |
|  8 | .53 |   | 7 | (.79 .71) |
|  9 | .71 |   | 8 | (.89)     |
| 10 |  .4 |   | 9 |           |
|----+-----+---+---+-----------|
</pre>
</div>
</div>
<div id="outline-container-org19a1fb8" class="outline-3">
<h3 id="org19a1fb8">8.4-2</h3>
<div class="outline-text-3" id="text-org19a1fb8">
<p>
The worst case appears when all elements fall in one bucket, the worst-case
running time is \(\Theta(n^2)\).
</p>

<p>
We could use \(O(n\lg n)\) sorting algorithm like heapsort or merge sort
instead of insertion sort as the intermediate sorting algorithm, then we
preserve the linear average-case running time and make the worst-case running
time \(O(n\lg n)\).
</p>
</div>
</div>
<div id="outline-container-org342c1ad" class="outline-3">
<h3 id="org342c1ad">8.4-3</h3>
<div class="outline-text-3" id="text-org342c1ad">
<p>
We define indicator random variable
</p>
\begin{align*}
X_i &= I\{\text{got head in the ith flip of coin}\}
\end{align*}
<p>
The indicator random variable \(X_i\) is \(1\) with probability \(1/2\) and
\(0\) with probability \(1/2\). We have
</p>
\begin{align*}
E[X^2]
&=E\Bigg[\bigg(\sum_{i=1}^{2}X_i\bigg)^2\Bigg]\\
&=E\bigg[\sum_{i=1}^{2}X_i^2
  +\sum_{1\leq i\leq 2}\sum_{1\leq j\leq 2,\ j\neq i}X_i X_j\bigg]\\
&=\sum_{i=1}^{2}E[X_i^2]
  +\sum_{1\leq i\leq 2}\sum_{1\leq j\leq 2,\ j\neq i}E[X_i X_j]\\
&=2\times(1)^2\times(1/2)+2\times(2-1)\times(1/2)^2\\
&=3/2
\end{align*}
<p>
and
</p>
\begin{align*}
E^2[X]
&=(E[X])^2\\
&=\Bigg(E\bigg[\sum_{i=1}^{2} X_i\bigg]\Bigg)^2\\
&=\bigg(\sum_{i=1}^{2} E[X_i]\bigg)^2\\
&=(2\times (1/2))^2\\
&=1
\end{align*}
</div>
</div>
<div id="outline-container-org65378e4" class="outline-3">
<h3 id="org65378e4">8.4-4</h3>
<div class="outline-text-3" id="text-org65378e4">
<p>
Sort the \(n\) points by their distances \(d_i = \sqrt{x_i^2 + y_i^2}\),
we define the \(n\) buckets, which for \(k = 1..n\), the \(k\)th bucket is
</p>
\begin{align*}
B_k &= \Bigg\{(x_i,y_i)
       \bigg|\sqrt{\frac{k-1}{n}}\leq d_i\leq\sqrt{\frac{k}{n}}\Bigg\}
\end{align*}
<p>
The \(n\) buckets divide the circle region into \(n\) regions which have the
same areas, thus a point has equal probability to fall into any bucket, the
average-case running time of the bucket sort algorithm is \(\Theta(n)\).
</p>
</div>
</div>
<div id="outline-container-org89b5411" class="outline-3">
<h3 id="org89b5411">8.4-5</h3>
<div class="outline-text-3" id="text-org89b5411">
<p>
We sort the \(n\) random variables with bucket sort by \(P(x)\), such we know
that a variable has the same probability to fall into each bucket, thus the
average-case running time is linear.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2023-08-17 Thu 10:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>